<?php

namespace Database\Seeders;

use App\Models\LaborFile;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LaborFileSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $datas = [
            [
                'id' => 40,
                'name' => '<p>投保單位填發之「<a href="https://www.bli.gov.tw/0106214.html">職業傷病門診單</a>」或「<a href="https://www.bli.gov.tw/0106215.html">職業傷病住院申請書</a>」。（投保單位未依規定填發者，被保險人得向本局及各地辦事處請領，經查明屬實後發給。）</p>',
            ],
            [
                'id' => 41,
                'name' => '<p>全民健康保險卡及國民身分證或其他足資證明身分之證件。（健保卡如印有照片，則不需再出示身分證明文件）</p>',
            ],
            [
                'id' => 42,
                'name' => '<p><a href="https://www.bli.gov.tw/0106216.html">勞工職業災害保險自墊醫療費用核退申請書及給付收據</a></p>',
            ],
            [
                'id' => 43,
                'name' => '<p>診斷書或證明文件。（如為外文文件，應檢附中文翻譯本。）</p>',
            ],
            [
                'id' => 44,
                'name' => '<p>醫療費用收據及收費明細。（如有遺失或供其他用途者，應檢附原出具之醫療機構加蓋印信註明與原正本相符字樣之影本。）</p>',
            ],
            [
                'id' => 45,
                'name' => '<p>因上、下班或公出途中發生事故，應另填具<a href="https://www.bli.gov.tw/0106218.html">勞工職業災害保險被保險人上下班（公出）途中發生事故而致傷害陳述書</a> ，並檢附駕駛人駕駛執照正背面影本。</p>',
            ],
            [
                'id' => 46,
                'name' => '<p>自111年5月1日起，因職業傷病及其引起之疾病就醫，如選用全民健康保險法第45條第1項所定<a href="https://www.nhi.gov.tw/Content_List.aspx?n=C19B4D51038D61F8&topn=5FE8C9FEAE863B46">自付差額特殊材料品項</a>者，應另檢附符合全民健康保險醫事服務機構特約及管理辦法規定之自付差額同意書。</p>',
            ],
            [
                'id' => 47,
                'name' => '<p>被保險人於我國境外遭遇職業傷病就診，應出具當次出入境證明文件影本或服務機關出具之證明。</p>',
            ],
            [
                'id' => 48,
                'name' => '<p>申請核退大陸地區住院5日（含）以上之自墊醫療費用案件，其醫療證明文書（醫療費用收據正本、費用明細、診斷書或證明文件等）須經大陸地區之公證處公證，再持公證書正本向財團法人海峽交流基金會申請驗證，完成驗證之文書，始予採認。</p>',
            ],
            [
                'id' => 49,
                'name' => '<p><a href="https://www.bli.gov.tw/0106236.html">勞工職業災害保險傷病給付(住院治療期間照護補助)申請書及給付(補助)收據</br>※被保險人申請傷病給付不能工作期間如係於退保後1年內，或投保單位有歇業、解散、撤銷、廢止、受破產宣告或其他情事，未能為被保險人蓋章提出申請者，被保險人得說明原因自行向本局申請。</a></p>',
            ],
            [
                'id' => 50,
                'name' => '<p>傷病診斷書正本※勞工遭遇職業傷病有住院治療且經醫師診斷住院期間需人照護（不包括入住具有加護或隔離性質之病房），一併申請住院照護補助時，診斷書需有入出院日期及住院期間需人照護之記載</p>',
            ],
            [
                'id' => 51,
                'name' => '<p>相關證明文件﹝如雇主（業主）及目擊者證明、出勤及請假紀錄、領薪紀錄等﹞。</p>',
            ],
            [
                'id' => 52,
                'name' => '<p>如為交通事故，首次申請時:<a href="https://www.bli.gov.tw/0106237.html">勞工職業災害被保險人上下班(公出)途中發生事故而致傷害陳述書</a></p>',
            ],
            [
                'id' => 53,
                'name' => '<p><a href="https://www.bli.gov.tw/0106712.html">勞工職業災害保險失能給付申請書及給付收據</a>。</p>',
            ],
            [
                'id' => 54,
                'name' => '<p><a href="https://www.bli.gov.tw/0106734.html">勞工職業災害保險失能診斷書</a>。經醫學檢查者，應併附檢查報告及相關影像圖片。</p>',
            ],
            [
                'id' => 55,
                'name' => '<p>申請失能年金加發眷屬補助者，另填具<a href="https://www.bli.gov.tw/0106717.html">勞工職業災害保險失能年金加發眷屬補助申請書及給付收據</a>（限請領年金給付且有符合加發眷屬補助條件之配偶或子女者填具）。</p>',
            ],
            [
                'id' => 56,
                'name' => '<p>申請照護補助者，另填具<a href="https://www.bli.gov.tw/0106718.html">勞工職業災害保險失能照護補助申請書及補助收據</a>。</p>',
            ],
            [
                'id' => 57,
                'name' => '<p><a href="https://www.bli.gov.tw/0106781.html">勞工職業災害保險死亡給付申請書及給付收據</a>。</p>',
            ],
            [
                'id' => 58,
                'name' => '<p>死亡證明書、檢察官相驗屍體證明書或死亡宣告判決書。</p>',
            ],
            [
                'id' => 59,
                'name' => '<p>載有死亡日期之被保險人全戶戶籍謄本及於死者死亡日期之後申請之請領人現住址戶籍謄本。（記事請勿省略）</p>',
            ],
            [
                'id' => 60,
                'name' => '<p>殯葬費用支出單據或證明文件。但支出殯葬費之人為當序受領遺屬年金或遺屬津貼者，得以切結書代替。</p>',
            ],
            [
                'id' => 61,
                'name' => '<p>載有被保險人死亡日期之全戶戶籍謄本，受益人為養子女時，須載有收養及登記日期；受益人與死者非同一戶籍者，應同時提出各該戶籍謄本。（記事請勿省略）</p>',
            ],
            [
                'id' => 62,
                'name' => '<p>死亡證明書或檢察官相驗屍體證明書，死亡宣告者為判決書。</p>',
            ],
            [
                'id' => 63,
                'name' => '<p>載有被保險人死亡日期之全戶戶籍謄本，受益人為養子女時，並需載有收養及登記日期；受益人與死者非同一戶籍者，應同時提出各該戶籍謄本。請領遺屬年金給付之受益人為配偶時，戶籍謄本應載有結婚日期。（記事請勿省略）</p>',
            ],
            [
                'id' => 64,
                'name' => '<p>以「在學」資格申請者（子女或孫子女）：應檢附在學證明或學費收據。在學證明或學費收據，應於每年 9 月底前，重新檢具相關證明送保險人查核，經查核符合條件者，遺屬年金應繼續發給至翌年 8 月底止。</p>',
            ],
            [
                'id' => 65,
                'name' => '<p>以「無謀生能力」資格申請者：檢附重度以上身心障礙手冊或證明，或受禁治產宣告之證明文件。</p>',
            ],
            [
                'id' => 66,
                'name' => '<p>以「受被保險人扶養」申請者（孫子女或兄弟姊妹）：應檢附受被保險人扶養事實之相關文件。</p>',
            ],
            [
                'id' => 67,
                'name' => '<p>載有被保險人死亡日期之全戶戶籍謄本，受益人為養子女時，並需載有收養及登記日期；受益人與死者非同一戶籍者，應同時提出各該戶籍謄本。（記事請勿省略）</p>',
            ],
            [
                'id' => 68,
                'name' => '<p>當序遺屬於被保險人死亡時，全部不符合遺屬年金給付條件之相關證明文件。</p>',
            ],
            [
                'id' => 69,
                'name' => '<p><a href="https://www.bli.gov.tw/0106770.html">勞工職業災害保險失蹤給付申請書及給付收據</a>。</p>',
            ],
            [
                'id' => 70,
                'name' => '<p>被保險人全戶戶籍謄本；受益人與被保險人非同一戶籍者，應同時提出各該戶籍謄本。</p>',
            ], [
                'id' => 71,
                'name' => '<p>災難報告書或失蹤人口緊急報案紀錄等相關事故證明</p>',
            ],
            [
                'id' => 72,
                'name' => '<p>執行職務發生意外事故證明</p>',
            ],
            [
                'id' => 73,
                'name' => '<p><a href="https://www.bli.gov.tw/0106519.htm">退保後職業病醫療補助申請書及給付收據</a>。</p>',
            ],
            [
                'id' => 74,
                'name' => '<p>職業病診斷書。（須由認可醫療機構職業醫學科專科醫師出具，離島地區得由原應診之醫師出具）</p>',
            ],
            [
                'id' => 75,
                'name' => '<p>醫療費用收據及費用明細。（如有遺失或供其他用途者，應檢附原出具之醫療機構加蓋印信註明與原正本相符字樣之影本。）</p>',
            ],
            [
                'id' => 76,
                'name' => '<p>勞工職業災害保險職業病職歷報告書（職業病診斷書已詳載職歷內容者免附）。</p>',
            ],
            [
                'id' => 77,
                'name' => '<p><a href="https://www.bli.gov.tw/0106733.html"退保後職業病失能津貼申請書及給付收據</a>。</p>',
            ], [
                'id' => 78,
                'name' => '<p>職業病診斷書。(須由認可醫療機構職業醫學科專科醫師出具)</p>',
            ],
            [
                'id' => 79,
                'name' => '<p><a href="https://www.bli.gov.tw/0106735.html">勞工職業災害保險職業病職歷報告書</a>。</p>',
            ],
            [
                'id' => 80,
                'name' => '<p><a href="https://www.bli.gov.tw/0106736.html">勞工職業災害保險失能照護補助申請書及補助收據</a>。</p>',
            ],
            [
                'id' => 81,
                'name' => '<p><a href="https://www.bli.gov.tw/0106817.html">退保後職業病死亡津貼申請書及給付收據</a>。</p>',
            ],
            [
                'id' => 82,
                'name' => '<p>死亡證明書或檢察官相驗屍體證明書。</p>',
            ],
            [
                'id' => 83,
                'name' => '<p>載有死亡日期之全戶戶籍謄本，遺屬為養子女時，應載有收養及登記日期；遺屬與死者非同一戶籍者，應同時提出各該戶籍謄本。</p>',
            ],
            [
                'id' => 84,
                'name' => '<p>遺屬為孫子女或兄弟姊妹者，應檢附受被保險人扶養之相關證明文件。</p>',
            ],
            [
                'id' => 85,
                'name' => '<p>職業病診斷書。（須由認可醫療機構職業醫學科專科醫師出具）</p>',
            ],
            [
                'id' => 86,
                'name' => '<p>未加保勞工職業災害失能補助申請書及補助收據。</p>',
            ],
            [
                'id' => 87,
                'name' => '<p>從事勞務或受僱之單位名稱、雇主姓名、地址、工作性質、內容及職業災害相關證明資料。</p>',
            ],
            [
                'id' => 88,
                'name' => '<p>罹患職業病者，檢附職業病診斷書及載有工作性質、內容、期間及暴露於何種作業環境或有害物等作業之職歷報告書。(職歷報告書內容已詳細載明於職業病診斷書者，免附。)</p>',
            ],
            [
                'id' => 89,
                'name' => '<p>未加保勞工職業災害死亡補助申請書及補助收據</p>',
            ],
            [
                'id' => 90,
                'name' => '<p>死亡證明書、檢察官相驗屍體證明書或死亡宣告裁定書。</p>',
            ],
            [
                'id' => 91,
                'name' => '<p>遺屬為孫子女或兄弟姊妹者，檢附受職業災害勞工扶養之相關證明文件。</p>',
            ],
            [
                'id' => 92,
                'name' => '<p>從事勞務或受僱之單位名稱、雇主姓名、地址、工作性質、內容及職業災害相關證明資料。(曾因同一職業傷病領取失能補助者，免附。)</p>',
            ],
            [
                'id' => 93,
                'name' => '<p>罹患職業病者，檢附職業病診斷書及載有工作性質、內容、期間及暴露於何種作業環境或有害物等作業之職歷報告書。(曾因同一職業傷病領取失能補助者，或職歷報告書內容已詳細載明於職業病診斷書者，免附。)</p>',
            ]
        ];

        foreach ($datas as $data) {
            LaborFile::firstOrCreate($data);
        }
    }
}
